Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooLarge
There are too many points on the selected layers of this dataset to place into the toposolid. Try selecting fewer layers to create the toposolid

Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFewPoints
The toposolid must have at least three distinct points

Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFarAway
Imported Toposolid Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.

Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.InvalidBoundaryError
Failed to get a valid boundary.